ErpTest/src/Documents/уатУстановкаПрейскурантовТС/уатУстановкаПрейскурантовТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатУстановкаПрейскурантовТС</name>
  <comment>Установка прейскурантов на транспортные услуги (уат)</comment>
  <registerRecords>InformationRegister.уатПрейскурантыТС</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетСогласования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Прейскуранты</name>
    <attributes>
      <name>Прейскурант</name>
      <comment>Прейскурант</comment>
      <type>
        <types>CatalogRef.уатПрейскурантыТС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ErpTest/src/InformationRegisters/уатПрейскурантыТС/уатПрейскурантыТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатПрейскурантыТС</name>
  <comment>Прейскуранты на транспортные услуги (уат)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Прейскурант</name>
    <comment>Прейскурант тарифов ТС</comment>
    <type>
      <types>CatalogRef.уатПрейскурантыТС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Documents/уатУстановкаПрейскурантовТС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	СформироватьТаблицуТС(ДокументСсылка, СтруктураДополнительныеСвойства);
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицуТС(ДокументСсылка, СтруктураДополнительныеСвойства)
	тблПрейскурантыТС = Новый ТаблицаЗначений;
	тблПрейскурантыТС.Колонки.Добавить("Регистратор");
	тблПрейскурантыТС.Колонки.Добавить("Период");
	тблПрейскурантыТС.Колонки.Добавить("Прейскурант");
	тблПрейскурантыТС.Колонки.Добавить("ДатаНачала");
	тблПрейскурантыТС.Колонки.Добавить("ДатаОкончания");
	
	Для Каждого ТекСтрокаПрейскурант Из ДокументСсылка.Прейскуранты Цикл
		НоваяСтрока = тблПрейскурантыТС.Добавить();
		НоваяСтрока.Период = ДокументСсылка.Дата;
		НоваяСтрока.Регистратор = ДокументСсылка;
		НоваяСтрока.Прейскурант = ТекСтрокаПрейскурант.Прейскурант;
		НоваяСтрока.ДатаНачала = ТекСтрокаПрейскурант.ДатаНачала;
		НоваяСтрока.ДатаОкончания = ТекСтрокаПрейскурант.ДатаОкончания;
	КонецЦикла;
	
	//управляемая блокировка
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.уатПрейскурантыТС");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = тблПрейскурантыТС;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Прейскурант", "Прейскурант");
	Блокировка.Заблокировать();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПрейскурантыТС", тблПрейскурантыТС);
КонецПроцедуры // СформироватьТаблицуАгрегатыТС()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	//Зарезервировано
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	Заглушка = Истина;
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ФОРМЫ

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//необходима для подключения внешних ПФ
	Заглушка = Истина;
КонецПроцедуры

#КонецЕсли
